# Задание 12
user_str = input('Введите строку: ')
user_str = user_str[::-1]
print(f'Перевернутая строка: {user_str}')