# Задание 3
num1 = input('Введите первое число: ')
num2 = input('Введите второе число: ')
print(f'Сумма ваших чисел: {num1 + num2}')
